def get_weapon_list_for_insert():
    wepon_list = [['ボールドマーカー'], [ 'ボールドマーカーネオ'], [ 'わかばシューター'], [ 'もみじシューター'], [ 'シャープマーカー'], [ 'シャープマーカーネオ'], [ 'プロモデラーMG'], [ 'プロモデラーRG'], [ 
                    'スプラシューター'], [ 'スプラシューターコラボ'], [ '.52ガロン'], [ 'N-ZAP85'], [ 'N-ZAP89'], [ 'プライムシューター'], [ 'プライムシューターコラボ'], [ '.96ガロン'], [ '96ガロンデコ'], [ 
                    'ジェットスイーパー'], [ 'ジェットスイーパーカスタム'], [ 'L3リールガン'], [ 'L3リールガンD'], [ 'H3リールガン'], [ 'H3リールガンD'], [ 'ボトルガイザー'], [ 'スペースシューター'], [ 'スペースシューターコラボ'], [
                    'ノヴァブラスター'], [ 'ノヴァブラスターネオ'], [ 'ホットブラスター'], [ 'ロングブラスター'], [ 'クラッシュブラスター'], [ 'クラッシュブラスターネオ'], [ 'ラピッドブラスター'], [ 'ラピッドブラスターデコ'], [ 
                     'Rブラスターエリート'], [ 'Rブラスターエリートデコ'], [ 'S-BLAST92'], [
                    'カーボンローラー'], [ 'カーボンローラーデコ'], [ 'スプラローラー'], [ 'スプラローラーコラボ'], [ 'ダイナモローラー'], [ 'ヴァリアブルローラー'], [ 
                    'ワイドローラー'], [ 'ワイドローラーコラボ'], [
                    'パブロ'], [ 'パブロ・ヒュー'], [ 'ホクサイ'], [ 'フィンセント'], [
                    'スクイックリンα'], [ 'スプラチャージャー'], [ 'スプラチャージャーコラボ'], [ 'スプラスコープ'], [ 'スプラスコープコラボ'], [ 'リッター4K'], [ '4Kスコープ'], [ '14式竹筒銃・甲'], [
                    'ソイチューバー'], [ 'R-PEN/5H'], [
                    'バケットスロッシャー'], [ 'バケットスロッシャーデコ'], [ 'ヒッセン'], [ 'ヒッセン・ヒュー'], [ 'スクリュースロッシャー'], [ 'オーバーフロッシャー'], [ 'エクスプロッシャー'], [ 
                    'スプラスピナー'], [ 'スプラスピナーコラボ'], [ 'バレルスピナー'], [ 'バレルスピナーデコ'], [ 'ハイドラント'], [ 'クーゲルシュライバー'], [ 'ノーチラス47'], [ 
                    'スパッタリー'], [ 'スパッタリー・ヒュー'], [ 'スプラマニューバー'], [ 'ケルビン525'], [ 'デュアルスイーパー'], [ 'デュアルスイーパーカスタム'], [ 'クアッドホッパーブラック'], [ 
                     'クアッドホッパーホワイト'], [
                    'パラシェルター'], [ 'キャンピングシェルター'], [ 'キャンピングシェルターソレーラ'], [ 'スパイガジェット'], [
                    'トライストリンガー'], [ 'LACT-450'], [ 
                    'ドライブワイパー'], [ 'ドライブワイパーデコ'], [ 'ジムワイパー']]
    return wepon_list

def wepon_list_for_drop_down():
    wepon_list =  [['ボールドマーカー', 'ボールドマーカーネオ', 'わかばシューター', 'もみじシューター', 'シャープマーカー', 'シャープマーカーネオ', 
                    'プロモデラーMG', 'プロモデラーRG', 'スプラシューター', 'スプラシューターコラボ', '.52ガロン', 'N-ZAP85', 'N-ZAP89',
                    'プライムシューター', 'プライムシューターコラボ', '.96ガロン', '96ガロンデコ'],
                    ['ジェットスイーパー', 'ジェットスイーパーカスタム', 
                    'L3リールガン', 'L3リールガンD', 'H3リールガン', 'H3リールガンD', 'ボトルガイザー', 'スペースシューター', 
                    'スペースシューターコラボ'],
                    ['ノヴァブラスター', 'ノヴァブラスターネオ', 'ホットブラスター', 'ロングブラスター', 'クラッシュブラスター', 'クラッシュブラスターネオ', 'ラピッドブラスター', 'ラピッドブラスターデコ', 
                     'Rブラスターエリート', 'Rブラスターエリートデコ', 'S-BLAST92'],
                    ['カーボンローラー', 'カーボンローラーデコ', 'スプラローラー', 'スプラローラーコラボ', 'ダイナモローラー', 'ヴァリアブルローラー', 
                    'ワイドローラー', 'ワイドローラーコラボ'],
                    ['パブロ', 'パブロ・ヒュー', 'ホクサイ', 'フィンセント'],
                    ['スクイックリンα', 'スプラチャージャー', 'スプラチャージャーコラボ', 'スプラスコープ', 'スプラスコープコラボ', 'リッター4K', '4Kスコープ', '14式竹筒銃・甲',
                    'ソイチューバー', 'R-PEN/5H'],
                    ['バケットスロッシャー', 'バケットスロッシャーデコ', 'ヒッセン', 'ヒッセン・ヒュー', 'スクリュースロッシャー', 'オーバーフロッシャー', 'エクスプロッシャー'], 
                    ['スプラスピナー', 'スプラスピナーコラボ', 'バレルスピナー', 'バレルスピナーデコ', 'ハイドラント', 'クーゲルシュライバー', 'ノーチラス47'], 
                    ['スパッタリー', 'スパッタリー・ヒュー', 'スプラマニューバー', 'ケルビン525', 'デュアルスイーパー', 'デュアルスイーパーカスタム', 'クアッドホッパーブラック', 
                     'クアッドホッパーホワイト'],
                    ['パラシェルター', 'キャンピングシェルター', 'キャンピングシェルターソレーラ', 'スパイガジェット'],
                    ['トライストリンガー', 'LACT-450'], 
                    ['ドライブワイパー', 'ドライブワイパーデコ', 'ジムワイパー']]
    return wepon_list

def get_weapon_category_num_dict():
    weapon_num_dict = {
        weapon_category.シューター1 : 0,
        weapon_category.シューター2 : 1,
        weapon_category.ブラスター : 2,
        weapon_category.ローラー : 3,
        weapon_category.フデ : 4,
        weapon_category.チャージャー : 5,
        weapon_category.スロッシャー : 6,
        weapon_category.スピナー : 7,
        weapon_category.マニューバー : 8,
        weapon_category.シェルター : 9,
        weapon_category.ストリンガー : 10,
        weapon_category.ワイパー : 11,
    }
    return weapon_num_dict
